<script setup>
    import cardCat from './cards/cardCat.vue';
    import cardDate from './cards/cardDate.vue';

    const cards = ref([
        {
            link: '/',
            title: 'Узбекские дипломаты провели встречу с соотечественниками, находящими в китайской провинции Ляонин',
            date: '13/06 22:46'
        },
        {
            link: '/',
            title: 'Узбекские дипломаты провели встречу с соотечественниками, находящими в китайской провинции Ляонин',
            date: '13/06 22:46'
        },
        {
            link: '/',
            title: 'Узбекские дипломаты провели встречу с соотечественниками, находящими в китайской провинции Ляонин',
            date: '13/06 22:46'
        },
        {
            link: '/',
            title: 'Узбекские дипломаты провели встречу с соотечественниками, находящими в китайской провинции Ляонин',
            date: '13/06 22:46'
        },
    ])

    const tabFilter = ref('tourism')
    const tabList = ref([
        {
            title: 'Туризм',
            slug: 'tourism',
            news: [
                {
                    link: '/',
                    title: 'Узбекские дипломаты провели встречу с соотечественниками, находящими в китайской провинции Ляонин',
                    day: '12',
                    month: 'июнь'
                },
                {
                    link: '/',
                    title: 'Узбекские дипломаты провели встречу с соотечественниками, находящими в китайской провинции Ляонин',
                    day: '12',
                    month: 'июнь'
                },
                {
                    link: '/',
                    title: 'Узбекские дипломаты провели встречу с соотечественниками, находящими в китайской провинции Ляонин',
                    day: '12',
                    month: 'июнь'
                },
                {
                    link: '/',
                    title: 'Узбекские дипломаты провели встречу с соотечественниками, находящими в китайской провинции Ляонин',
                    day: '12',
                    month: 'июнь'
                },
                {
                    link: '/',
                    title: 'Узбекские дипломаты провели встречу с соотечественниками, находящими в китайской провинции Ляонин',
                    day: '12',
                    month: 'июнь'
                },
                {
                    link: '/',
                    title: 'Узбекские дипломаты провели встречу с соотечественниками, находящими в китайской провинции Ляонин',
                    day: '12',
                    month: 'июнь'
                },
                {
                    link: '/',
                    title: 'Узбекские дипломаты провели встречу с соотечественниками, находящими в китайской провинции Ляонин',
                    day: '12',
                    month: 'июнь'
                },
            ]
        },
        {
            title: 'Наука',
            slug: 'science',
            news: [
                {
                    link: '/',
                    title: 'Ученые обнаружили новый вид микроорганизмов, способных перерабатывать пластик, что может помочь в решении проблемы загрязнения окружающей среды.',
                    day: '1',
                    month: 'март'
                },
                {
                    link: '/',
                    title: 'Ученые обнаружили новый вид микроорганизмов, способных перерабатывать пластик, что может помочь в решении проблемы загрязнения окружающей среды.',
                    day: '1',
                    month: 'март'
                },
                {
                    link: '/',
                    title: 'Ученые обнаружили новый вид микроорганизмов, способных перерабатывать пластик, что может помочь в решении проблемы загрязнения окружающей среды.',
                    day: '1',
                    month: 'март'
                },
                {
                    link: '/',
                    title: 'Ученые обнаружили новый вид микроорганизмов, способных перерабатывать пластик, что может помочь в решении проблемы загрязнения окружающей среды.',
                    day: '1',
                    month: 'март'
                },
                {
                    link: '/',
                    title: 'Ученые обнаружили новый вид микроорганизмов, способных перерабатывать пластик, что может помочь в решении проблемы загрязнения окружающей среды.',
                    day: '1',
                    month: 'март'
                },
                {
                    link: '/',
                    title: 'Ученые обнаружили новый вид микроорганизмов, способных перерабатывать пластик, что может помочь в решении проблемы загрязнения окружающей среды.',
                    day: '1',
                    month: 'март'
                },
                {
                    link: '/',
                    title: 'Ученые обнаружили новый вид микроорганизмов, способных перерабатывать пластик, что может помочь в решении проблемы загрязнения окружающей среды.',
                    day: '1',
                    month: 'март'
                },
            ]
        },
        {
            title: 'Образование',
            slug: 'education',
            news: [
                {
                    link: '/',
                    title: 'Узбекские дипломаты провели встречу с соотечественниками, находящими в китайской провинции Ляонин',
                    day: '25',
                    month: 'июнь'
                },
                {
                    link: '/',
                    title: 'Узбекские дипломаты провели встречу с соотечественниками, находящими в китайской провинции Ляонин',
                    day: '25',
                    month: 'июнь'
                },
                {
                    link: '/',
                    title: 'Узбекские дипломаты провели встречу с соотечественниками, находящими в китайской провинции Ляонин',
                    day: '25',
                    month: 'июнь'
                },
                {
                    link: '/',
                    title: 'Узбекские дипломаты провели встречу с соотечественниками, находящими в китайской провинции Ляонин',
                    day: '25',
                    month: 'июнь'
                },
                {
                    link: '/',
                    title: 'Узбекские дипломаты провели встречу с соотечественниками, находящими в китайской провинции Ляонин',
                    day: '25',
                    month: 'июнь'
                },
                {
                    link: '/',
                    title: 'Узбекские дипломаты провели встречу с соотечественниками, находящими в китайской провинции Ляонин',
                    day: '25',
                    month: 'июнь'
                },
                {
                    link: '/',
                    title: 'Узбекские дипломаты провели встречу с соотечественниками, находящими в китайской провинции Ляонин',
                    day: '25',
                    month: 'июнь'
                },
            ]
        },
    ])
</script>

<template>
    <div class="central">
        <div class="container">
            <div class="central__box">
                <div class="central__left">
                    <div class="central__title">Центральная Азия</div>

                    <div class="central__main">
                        <div class="central__poster poster">
                            <div class="poster__date">13/06 22:46</div>
                            <div class="poster__title">Информационное сообщение ИА «Дунё» по ситуации вокруг Тайваня</div>
                        </div>

                        <ul class="central__cards">
                            <cardCat 
                                class="central__card"
                                :card="item"
                                v-for="item, index of cards"
                                :key="index"
                            />
                        </ul>
                    </div>
                </div>
                <div class="central__right">
                    <ul class="btns">
                        <li v-for="item of tabList" :key="item.slug">
                            <button @click="tabFilter = item.slug" :class="tabFilter == item.slug ? 'active' : ''">{{ item.title }}</button>
                        </li>
                    </ul>

                    <ul class="news">
                        <div v-for="item of tabList" :key="item.slug" :class="`news__content ${tabFilter == item.slug ? 'active' : ''}`">
                            <cardDate
                                :class="
                                    tabFilter == 'tourism' ? 'tourism news__item' 
                                    : tabFilter == 'science' ? 'science news__item' 
                                    : tabFilter == 'education' ? 'education news__item' 
                                    : 'news__item'
                                "
                                :card="item"
                                v-for="item, index of item.news"
                                :key="index"
                            />
                        </div>
                    </ul>
                </div>
            </div>
        </div>
    </div>
</template>

<style lang="scss">
@import '@/assets/styles/components/central.scss';
</style>