<script setup>

</script>

<template>
    <div class="article">
        <div class="article__box">
            <p>ВАРШАВА, 11 января. /ИА “Дунё”/. В Посольстве Узбекистана в Варшаве состоялась встреча с участием узбекских студентов, обучающихся в польских вузах, и сограждан, временно проживающих и работающих в этой стране, сообщает корреспондент ИА “Дунё”.</p>

            <img src="/images/single.png">

            <p>На встрече соотечественники были ознакомлены с содержанием Послания Президента Узбекистана Олий Мажлису и народу, с которым глава нашего государства выступил 20 декабря 2022 года, а также ходом реализации широкомасштабных реформ, проводимых в нашей стране.
            <br> <br>
            Дипломаты представили соотечественникам подробную информацию о целях и приоритетах молодежной политики, проводимой главой нашего государства. Особый акцент был сделан на важности усилий, направленных на создание условий для социального и духовного развития молодежи. Внимание собравшихся было обращено на то, что 2023 год объявлен в Узбекистане «Годом заботы о человеке и качественного образования».
            <br> <br>
            Подчеркивалось, что независимость позволила узбекскому народу глубже изучить и познать свою историю, приобщиться к культурному и духовному наследию. За прошедши годы наша страна пережила новый период своего исторического развития, добилась значительных успехов в различных областях, которые послужили обеспечению благосостояния узбекского народа, укреплению защиты их прав и интересов.
            <br> <br>
            Отмечалось, что авторитет Узбекистана на международной арене неуклонно растет, в сотрудничестве с зарубежными странами и организациями реализуются крупные экономические и социальные проекты.
            <br> <br>
            В ходе выступлений подчеркивалась необходимость сохранения преемственности между поколениями традиций и национальных ценностей, таких как уважение к старшим, к женщинам, вклад в молодежь и образование.
            В ходе встречи также были обсуждены вопросы создания достойных условий для граждан, работающих за границей, поддержки и обеспечения их прав, необходимости выполнения требований, предусмотренных трудовым договором в стране пребывания, дальнейшего укрепления здоровья и социальной защиты работников. Дипломаты также оказали консульско-правовые консультации гражданам, занимающимся трудовой деятельностью.</p>
        </div>

        <div class="article__poster">
            <img src="@/assets/img/economy/poster.jpg">
        </div>
    </div>
</template>

<style lang="scss">
@import '@/assets/styles/components/singleArticle.scss';
</style>