<script setup>
const bread = ref({
    title: 'Инвестиции'
})

const listData = ref({
    mode: 'big',
    list: [
        {
            link: '/',
            title: 'Узбекские дипломаты провели встречу с соотечественниками, находящими в китайской провинции Ляонин',
            date: '13/06 22:46'
        },
        {
            link: '/',
            title: 'Узбекские дипломаты провели встречу с соотечественниками, находящими в китайской провинции Ляонин',
            date: '13/06 22:46'
        },
        {
            link: '/',
            title: 'Узбекские дипломаты провели встречу с соотечественниками, находящими в китайской провинции Ляонин',
            date: '13/06 22:46'
        },
        {
            link: '/',
            title: 'Узбекские дипломаты провели встречу с соотечественниками, находящими в китайской провинции Ляонин',
            date: '13/06 22:46'
        },
        {
            link: '/',
            title: 'Узбекские дипломаты провели встречу с соотечественниками, находящими в китайской провинции Ляонин',
            date: '13/06 22:46'
        },
        {
            link: '/',
            title: 'Узбекские дипломаты провели встречу с соотечественниками, находящими в китайской провинции Ляонин',
            date: '13/06 22:46'
        },
        {
            link: '/',
            title: 'Узбекские дипломаты провели встречу с соотечественниками, находящими в китайской провинции Ляонин',
            date: '13/06 22:46'
        },
    ]
})

const importantData = ref({
    title: 'Важные даты',
    mode: '',
    list: [
        {
            link: '/',
            title: 'Узбекские дипломаты провели встречу с соотечественниками, находящими в китайской провинции Ляонин',
            date: '13/06 22:46'
        },
        {
            link: '/',
            title: 'Узбекские дипломаты провели встречу с соотечественниками, находящими в китайской провинции Ляонин',
            date: '13/06 22:46'
        },
        {
            link: '/',
            title: 'Узбекские дипломаты провели встречу с соотечественниками, находящими в китайской провинции Ляонин',
            date: '13/06 22:46'
        },
        {
            link: '/',
            title: 'Узбекские дипломаты провели встречу с соотечественниками, находящими в китайской провинции Ляонин',
            date: '13/06 22:46'
        },
        {
            link: '/',
            title: 'Узбекские дипломаты провели встречу с соотечественниками, находящими в китайской провинции Ляонин',
            date: '13/06 22:46'
        },
    ]
})

const scienceData = ref({
    title: 'Наука и Здравохранение',
    mode: '',
    list: [
        {
            link: '/',
            title: 'Узбекские дипломаты провели встречу с соотечественниками, находящими в китайской провинции Ляонин',
            date: '13/06 22:46'
        },
        {
            link: '/',
            title: 'Узбекские дипломаты провели встречу с соотечественниками, находящими в китайской провинции Ляонин',
            date: '13/06 22:46'
        },
        {
            link: '/',
            title: 'Узбекские дипломаты провели встречу с соотечественниками, находящими в китайской провинции Ляонин',
            date: '13/06 22:46'
        },
        {
            link: '/',
            title: 'Узбекские дипломаты провели встречу с соотечественниками, находящими в китайской провинции Ляонин',
            date: '13/06 22:46'
        },
        {
            link: '/',
            title: 'Узбекские дипломаты провели встречу с соотечественниками, находящими в китайской провинции Ляонин',
            date: '13/06 22:46'
        },
    ]
})

const sportData = ref({
    title: 'Спорт',
    mode: '',
    list: [
        {
            link: '/',
            title: 'Узбекские дипломаты провели встречу с соотечественниками, находящими в китайской провинции Ляонин',
            date: '13/06 22:46'
        },
        {
            link: '/',
            title: 'Узбекские дипломаты провели встречу с соотечественниками, находящими в китайской провинции Ляонин',
            date: '13/06 22:46'
        },
        {
            link: '/',
            title: 'Узбекские дипломаты провели встречу с соотечественниками, находящими в китайской провинции Ляонин',
            date: '13/06 22:46'
        },
        {
            link: '/',
            title: 'Узбекские дипломаты провели встречу с соотечественниками, находящими в китайской провинции Ляонин',
            date: '13/06 22:46'
        },
        {
            link: '/',
            title: 'Узбекские дипломаты провели встречу с соотечественниками, находящими в китайской провинции Ляонин',
            date: '13/06 22:46'
        },
    ]
})
</script>

<template>
    <NuxtLayout name="alt-header">
        <div class="categories">
            <Breadcrumbs  
                :breadObj="bread"
            />
            <div class="categories__body">
                <div class="container">
                    <div class="categories__box">
                        <div class="categories__left">
                            <catWrapper />
                            <catList 
                                :listData="listData"
                            />
                        </div>
                        <div class="categories__right">
                            <catMore 
                                :moreData="importantData"
                                class="categories__more"
                            />

                            <div class="categories__banner">
                                <img src="@/assets/img/economy/poster.jpg">
                            </div>

                            <catMore 
                                :moreData="scienceData"
                                class="categories__more"
                            />

                            <catMore 
                                :moreData="sportData"
                                class="categories__more"
                            />
                        </div>
                    </div>
                </div>
            </div>
            <Sponsors />
        </div>
    </NuxtLayout>
</template>

<style lang="scss">
.categories{
    &__box{
        padding: 40px 0px 90px;
        display: flex;
    }
    &__left{
        flex-basis: 66.6666%;
        width: 66.6666%;
        padding-right: 20px;
    }
    &__right{
        flex-basis: 33.3333%;
        width: 33.3333%;
        margin: -15px 0px;
    }
    &__more{
        padding: 15px 0px;
    }
    &__banner{
        height: 130px;
        padding: 15px 0px;
        img{
            width: 100%;
            height: 100%;
            object-fit: cover;
            object-position: center;
        }
    }
}
</style>